{
    "module": "keras.src.models.functional",
    "class_name": "Functional",
    "config": {
        "name": "functional",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        50
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer"
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 0.1
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        50
                    ]
                },
                "name": "dense",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        50
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "input_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "batch_normalization",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dense",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": null,
                "class_name": "CustomGridDropout",
                "config": {
                    "name": "custom_grid_dropout",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "ratio": 0.3,
                    "holes_number": 10,
                    "p": 0.3
                },
                "registered_name": "CustomGridDropout",
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "custom_grid_dropout",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "batch_normalization",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.7,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "name": "dropout",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "custom_grid_dropout",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 0.1
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "dense_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dropout",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "batch_normalization_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dense_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": null,
                "class_name": "CustomGridDropout",
                "config": {
                    "name": "custom_grid_dropout_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "ratio": 0.3,
                    "holes_number": 5,
                    "p": 0.3
                },
                "registered_name": "CustomGridDropout",
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "custom_grid_dropout_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "batch_normalization_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "rate": 0.4,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "name": "dropout_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "custom_grid_dropout_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 0.1
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "dense_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dropout_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "batch_normalization_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dense_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": null,
                "class_name": "MemoryAugmentedLayer",
                "config": {
                    "name": "memory_augmented_layer",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "memory_size": 20,
                    "memory_dim": 64
                },
                "registered_name": "MemoryAugmentedLayer",
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "memory_augmented_layer",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "batch_normalization_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": null,
                "class_name": "GradientReversalLayer",
                "config": {
                    "name": "gradient_reversal_layer",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "lambda_": 1.0
                },
                "registered_name": "GradientReversalLayer",
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "gradient_reversal_layer",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "memory_augmented_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 32,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "dense_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "gradient_reversal_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "classification",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 5,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "classification",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "memory_augmented_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "domain",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 2,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32
                    ]
                },
                "name": "domain",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "dense_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            }
        ],
        "input_layers": [
            [
                "input_layer",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "classification",
                0,
                0
            ],
            [
                "domain",
                0,
                0
            ]
        ]
    },
    "registered_name": "Functional",
    "build_config": {
        "input_shape": null
    }
}